# HorizontalOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HostedSweep..::..HorizontalOffset Property
HostedSweep Class See Also
---
Retrieve/set the horizontal offset of the hosted sweep object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double HorizontalOffset { get; set; }
```

Visual Basic
---
```text
Public Property HorizontalOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double HorizontalOffset {
	double get ();
	void set (double value);
}
```

# See Also
HostedSweep Class
Autodesk.Revit.DB Namespace